fun main() {
    println("Типы данных в Kotlin:")

    println("\nЦелочисленные типы:")
    println("\tInt: от -2 147 483 648 (-231) до 2 147 483 647 (231 - 1); занимает 4 байта")
    println("\tLong: от –9 223 372 036 854 775 808 (-263) до 9 223 372 036 854 775 807 (263-1); занимает 8 байт")
    println("\tShort: от -32 768 до 32 767; занимает 2 байта")
    println("\tByte: от -128 до 127; занимает 1 байт")

    println("\nСтроковые типы:")
    println("\tString: строка в ковычках")

    println("\nДругие типы данных:")
    println("\tBoolean: хранит true или false")
    println("\tChar: отделный символ в ковычках. пример: val a: Char = 'A'")
}
